[
  {
    "country": "United States of America",
    "news": [
      {
        "id": 1,
        "title": "US Launches 'STEM Scholars 2025' Grant for International Students",
        "date": "2025-09-05",
        "category": "Scholarships",
        "description": "The US Department of Education has introduced the STEM Scholars 2025 Grant, providing up to $20,000 in financial aid for international students pursuing advanced degrees in science, technology, engineering, and mathematics.",
        "image": "https://images.unsplash.com/photo-1555374018-13a8994ab246?auto=format&fit=crop&w=1200&q=80",
        "source": "US Department of Education",
        "content": "In a move to strengthen America’s leadership in STEM innovation, the US Department of Education has announced the STEM Scholars 2025 Grant. The initiative will fund up to $20,000 per year for top-performing international students in STEM programs at accredited US institutions.\n\nThe program aims to attract global talent in artificial intelligence, data science, biotechnology, and climate technology. Recipients will also gain mentorship access to industry professionals and university research labs. Applications open in November 2025 for the Fall 2026 academic intake.",
        "overview_title": "Overview of STEM Scholars 2025",
        "overview_image": "https://blogmedia.testbook.com/blog/wp-content/uploads/2025/07/image_2-9-3d235c6c.png",
        "overview_content": "The STEM Scholars 2025 program is designed to support international students pursuing advanced degrees in STEM fields. It aims to attract top global talent and ensure the US remains a leader in technology and innovation.",
        "details_title": "Program Details",
        "details_image": "https://www.universityliving.com/blog/wp-content/uploads/2025/03/Education-Sysytem-in-USA-768x461.webp",
        "details_content": "Students can receive up to $20,000 per year. They will gain mentorship, lab access, and networking opportunities with industry leaders. Applications are accepted online, and the program is open to both undergraduate and postgraduate students.",
        "impact_title": "Impact on Students and Institutions",
        "impact_content": "This grant provides financial relief, fosters international collaboration, and encourages academic excellence. Universities benefit from attracting highly qualified students, enhancing research outcomes and global reputation.",
        "related_initiatives_title": "Related Initiatives",
        "related_initiatives_content": "The grant complements other US Department of Education programs like Research Fellowships and Innovation Labs, supporting STEM education and career pathways for international students.",
        "future_outlook_title": "Future Outlook",
        "future_outlook_content": "With growing global competition in STEM fields, this grant is expected to boost the number of international students choosing the US, contributing to innovation and long-term economic growth."
      },
      {
        "id": 2,
        "title": "US Universities Dominate Global Rankings 2025",
        "date": "2025-08-30",
        "category": "Rankings",
        "description": "Harvard, Stanford, and MIT continue to lead in global university rankings, maintaining the USA’s strong reputation for academic excellence and research output.",
        "image": "https://images.unsplash.com/photo-1503676260728-1c00da094a0b?auto=format&fit=crop&w=1200&q=80",
        "source": "QS World University Rankings",
        "content": "The 2025 QS World University Rankings reaffirm the United States’ dominance in higher education, with five US institutions in the top 10 and over 30 in the top 100. MIT retained its number-one position for the 13th consecutive year, followed by Stanford University and Harvard University.\n\nExperts attribute this continued success to strong research funding, cutting-edge facilities, and extensive collaboration between academia and industry. For international students, the rankings highlight the breadth of opportunity and innovation available across the American education system.",
        "overview_title": "Overview of Rankings",
        "overview_image": "https://blogmedia.testbook.com/blog/wp-content/uploads/2025/07/image_2-9-3d235c6c.png",
        "overview_content": "The 2025 QS Rankings showcase US universities’ consistent global leadership in education, research, and innovation, emphasizing their appeal to international students.",
        "details_title": "Details Behind the Rankings",
        "details_image": "https://www.universityliving.com/blog/wp-content/uploads/2025/03/Education-Sysytem-in-USA-768x461.webp",
        "details_content": "Top universities like MIT, Stanford, and Harvard excel in faculty quality, research output, employer reputation, and international student diversity, leading to high rankings.",
        "impact_title": "Impact on International Students",
        "impact_content": "High rankings attract talented international students, increase scholarship opportunities, and provide access to world-class research facilities and career networks.",
        "related_initiatives_title": "Related University Programs",
        "related_initiatives_content": "Universities run numerous fellowships, exchange programs, and collaborative research projects, reinforcing their global standing and supporting student development.",
        "future_outlook_title": "Future Outlook",
        "future_outlook_content": "US universities are expected to maintain leadership through strategic investments in research, international collaboration, and innovation-driven curricula."
      },
      {
        "id": 3,
        "title": "US Streamlines Student Visa Process for 2026 Intakes",
        "date": "2025-09-15",
        "category": "Visa Update",
        "description": "The US State Department has announced new measures to expedite F-1 visa approvals, reducing interview wait times and expanding digital document submissions.",
        "image": "https://img.freepik.com/free-vector/american-flag-usa-text-design_460848-13076.jpg?semt=ais_hybrid&w=740&q=80",
        "source": "US Embassy India",
        "content": "To support a record number of student applicants, the US State Department has introduced several enhancements to the visa process. These include expanded appointment slots at embassies, online verification systems, and faster processing times for F-1 and J-1 visas.\n\nThe improvements are part of the 'Study in the USA 2026' initiative, designed to make higher education in America more accessible to global learners. Officials predict that average visa processing time will drop from 8 weeks to under 4 weeks by 2026.",
        "overview_title": "Overview of Visa Streamlining",
        "overview_image": "https://blogmedia.testbook.com/blog/wp-content/uploads/2025/07/image_2-9-3d235c6c.png",
        "overview_content": "The US has implemented reforms to simplify and accelerate student visa processing, making it easier for international students to study in the US.",
        "details_title": "Details of New Measures",
        "details_image": "https://www.universityliving.com/blog/wp-content/uploads/2025/03/Education-Sysytem-in-USA-768x461.webp",
        "details_content": "Enhancements include online document submissions, expanded embassy appointment slots, and faster processing for F-1 and J-1 visas, reducing overall waiting time.",
        "impact_title": "Impact on Students",
        "impact_content": "Reduced processing times allow students to plan studies and accommodation better, increasing confidence in choosing the US as a study destination.",
        "related_initiatives_title": "Related Initiatives",
        "related_initiatives_content": "The visa reforms complement the 'Study in the USA 2026' initiative, scholarships, and university preparatory programs to support international students.",
        "future_outlook_title": "Future Outlook",
        "future_outlook_content": "With faster processing and digital enhancements, the US aims to maintain its competitive edge as a leading global education hub."
      },
      {
        "id": 4,
        "title": "University of California Expands Sustainable Campus Program",
        "date": "2025-08-10",
        "category": "University Update",
        "description": "The University of California system has launched a new Sustainable Campus Initiative to promote renewable energy, green infrastructure, and environmental education across all ten campuses.",
        "image": "https://static.toiimg.com/thumb/84475061/America-name.jpg?width=636&height=358&resize=4",
        "source": "University of California",
        "content": "The University of California (UC) has committed to becoming the first public university system in the world to achieve full carbon neutrality by 2035. As part of its Sustainable Campus Initiative, UC will invest in solar farms, electric transport, and sustainable housing for students.\n\nInternational students will have opportunities to participate in research on environmental technology, policy innovation, and renewable energy deployment. The initiative also includes new scholarships for students in environmental sciences and public policy.",
        "overview_title": "Overview of Sustainable Campus Program",
        "overview_image": "https://blogmedia.testbook.com/blog/wp-content/uploads/2025/07/image_2-9-3d235c6c.png",
        "overview_content": "UC’s initiative promotes sustainability, green infrastructure, and environmental research across all campuses, with strong support for international students.",
        "details_title": "Program Details",
        "details_image": "https://www.universityliving.com/blog/wp-content/uploads/2025/03/Education-Sysytem-in-USA-768x461.webp",
        "details_content": "Investments include solar energy projects, electric transport, sustainable housing, and scholarship opportunities for students pursuing environmental sciences.",
        "impact_title": "Impact on Students and Faculty",
        "impact_content": "Students gain hands-on experience in sustainability projects, while faculty benefit from advanced research facilities and collaborations in green technology.",
        "related_initiatives_title": "Related Initiatives",
        "related_initiatives_content": "UC partners with government agencies and private organizations to expand sustainability research and education initiatives.",
        "future_outlook_title": "Future Outlook",
        "future_outlook_content": "The program aims for full carbon neutrality by 2035, setting a benchmark for sustainable education practices worldwide."
      },
      {
        "id": 5,
        "title": "US Tech Firms Partner with Universities to Offer Paid Internships",
        "date": "2025-09-25",
        "category": "Career Opportunities",
        "description": "Leading American tech companies such as Google, Microsoft, and Tesla are collaborating with universities to provide paid internship programs tailored for international students.",
        "image": "https://images.unsplash.com/photo-1551434678-e076c223a692?auto=format&fit=crop&w=1200&q=80",
        "source": "Tech News Today",
        "content": "Major technology corporations in the United States have joined forces with top-tier universities to create structured internship pipelines for international students. The initiative provides hands-on experience in AI, robotics, and cloud computing, ensuring students are industry-ready upon graduation.\n\nParticipating institutions include MIT, Carnegie Mellon, and the University of Texas at Austin. The program aligns with America’s push to foster a skilled global workforce capable of contributing to the nation’s growing innovation ecosystem.",
        "overview_title": "Overview of Internship Partnerships",
        "overview_image": "https://blogmedia.testbook.com/blog/wp-content/uploads/2025/07/image_2-9-3d235c6c.png",
        "overview_content": "US tech companies collaborate with universities to offer paid internships, enhancing practical learning and career readiness for international students.",
        "details_title": "Program Details",
        "details_image": "https://www.universityliving.com/blog/wp-content/uploads/2025/03/Education-Sysytem-in-USA-768x461.webp",
        "details_content": "Internships provide hands-on experience in AI, robotics, cloud computing, and other emerging technologies. Students also receive mentorship from industry professionals.",
        "impact_title": "Impact on Students",
        "impact_content": "Internships help students gain real-world skills, improve employability, and build networks within the US tech industry.",
        "related_initiatives_title": "Related Programs",
        "related_initiatives_content": "These internships complement STEM scholarships, research fellowships, and cooperative education programs to provide a comprehensive learning experience.",
        "future_outlook_title": "Future Outlook",
        "future_outlook_content": "Continued collaboration between tech firms and universities is expected to expand opportunities and maintain US leadership in innovation."
      },
      {
        "id": 6,
        "title": "Post-Study Work Opportunities Expanded for STEM Graduates",
        "date": "2025-10-04",
        "category": "Visa Update",
        "description": "The US government has extended Optional Practical Training (OPT) for STEM graduates, allowing them to work for up to three years after graduation in relevant industries.",
        "image": "https://images.unsplash.com/photo-1504384308090-c894fdcc538d?auto=format&fit=crop&w=1200&q=80",
        "source": "Homeland Security Department",
        "content": "The Department of Homeland Security has expanded Optional Practical Training (OPT) for STEM graduates, enabling them to stay and work in the US for up to 36 months after graduation. The policy aims to attract and retain top international talent in technology and science-related fields.\n\nThe updated rules also include stronger employer compliance measures and clearer pathways for transitioning to H-1B and permanent residency visas. Universities and employers have hailed the move as a strategic step to reinforce America’s role as a global innovation hub.",
        "overview_title": "Overview of OPT Expansion",
        "overview_image": "https://blogmedia.testbook.com/blog/wp-content/uploads/2025/07/image_2-9-3d235c6c.png",
        "overview_content": "The US has expanded post-study work opportunities for STEM graduates, allowing extended employment in technology and research sectors.",
        "details_title": "Program Details",
        "details_image": "https://www.universityliving.com/blog/wp-content/uploads/2025/03/Education-Sysytem-in-USA-768x461.webp",
        "details_content": "Eligible STEM graduates can work for up to 36 months after graduation. The expansion includes stricter employer compliance and guidance for H-1B visa transitions.",
        "impact_title": "Impact on Graduates",
        "impact_content": "Graduates gain valuable US work experience, enhance employability, and have a pathway to permanent residency.",
        "related_initiatives_title": "Related Programs",
        "related_initiatives_content": "This expansion complements STEM scholarships, research grants, and internship programs to attract and retain global talent.",
        "future_outlook_title": "Future Outlook",
        "future_outlook_content": "The initiative strengthens the US STEM workforce and ensures continued leadership in innovation and technology."
      }
    ]
  }
]